bradhawkins85/ESP32-Uptime-Monitoring-Touch/src/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <ESPAsyncWebServer.h>
#include <ArduinoJson.h>
#include <FS.h>
#include <LittleFS.h>
#include <HTTPClient.h>
#include <ESP32Ping.h>
#include <mbedtls/base64.h>
#define LGFX_USE_V1
#include <LovyanGFX.hpp>
#include <lgfx/v1/platforms/esp32s3/Panel_RGB.hpp>
#include <lgfx/v1/platforms/esp32s3/Bus_RGB.hpp>
#include <Adafruit_FT6206.h>
#include <Wire.h>

#include "config.hpp"

// --- Display and touch configuration ---
#ifndef TFT_WIDTH
#define TFT_WIDTH 480   // changed from 320 to 480
#endif

#ifndef TFT_HEIGHT
#define TFT_HEIGHT 480
#endif

#ifndef TFT_SCLK_PIN
#define TFT_SCLK_PIN 12
#endif

#ifndef TFT_MOSI_PIN
#define TFT_MOSI_PIN 11
#endif

#ifndef TFT_MISO_PIN
#define TFT_MISO_PIN -1
#endif

#ifndef TFT_CS_PIN
#define TFT_CS_PIN 39   // LCD_CS per pinout (IO39)
#endif

#ifndef TFT_DC_PIN
#define TFT_DC_PIN 9
#endif

#ifndef TFT_RST_PIN
#define TFT_RST_PIN 14
#endif

#ifndef TFT_BL_PIN
#define TFT_BL_PIN 38   // BL_C per pinout (IO38)
#endif

#ifndef TFT_BL_FREQ
#define TFT_BL_FREQ 44100
#endif

#ifndef TFT_BL_PWM_CHANNEL
#define TFT_BL_PWM_CHANNEL 7
#endif

#ifndef TOUCH_SDA_PIN
#define TOUCH_SDA_PIN 38
#endif

#ifndef TOUCH_SCL_PIN
#define TOUCH_SCL_PIN 39
#endif

#ifndef TOUCH_INT_PIN
#define TOUCH_INT_PIN -1
#endif

bool isNtfyConfigured() {
  return strlen(NTFY_TOPIC) > 0;
}

bool isDiscordConfigured() {
  return strlen(DISCORD_WEBHOOK_URL) > 0;
}

bool isSmtpConfigured() {
  return strlen(SMTP_SERVER) > 0 && strlen(SMTP_FROM_ADDRESS) > 0 &&
         strlen(SMTP_TO_ADDRESS) > 0;
}

void sendNtfyNotification(const String& title, const String& message, const String& tags = "warning,monitor");
void sendDiscordNotification(const String& title, const String& message);
void sendSmtpNotification(const String& title, const String& message);

AsyncWebServer server(80);



// LGFX device configured for ST7701 parallel RGB (16-bit) using pin mapping from your image.
// NOTE: This is a best-effort mapping. If your DB numbering is offset (DB0 vs DB1), adjust
// the d0..d15 pins below by +/-1 accordingly.
class LGFX : public lgfx::LGFX_Device {
  lgfx::Bus_RGB _bus_instance;
  lgfx::Panel_ST7701 _panel_instance;
  lgfx::Light_PWM _light_instance;

 public:
  LGFX() {
    // Panel configuration
    {
      auto cfg = _panel_instance.config();
      cfg.memory_width  = TFT_WIDTH;
      cfg.memory_height = TFT_HEIGHT;
      cfg.panel_width   = TFT_WIDTH;
      cfg.panel_height  = TFT_HEIGHT;
      cfg.offset_x = 0;
      cfg.offset_y = 0;
      _panel_instance.config(cfg);
    }

    // Panel detail configuration (SPI pins for ST7701 initialization)
    {
      auto cfg = _panel_instance.config_detail();
      cfg.pin_cs   = TFT_CS_PIN;
      cfg.pin_sclk = TFT_SCLK_PIN;
      cfg.pin_mosi = TFT_MOSI_PIN;
      _panel_instance.config_detail(cfg);
    }

    // RGB Bus configuration
    {
      auto cfg = _bus_instance.config();
      cfg.panel = &_panel_instance;
      // Data pins d0..d15 mapped from the table you supplied (DB1..DB17).
      // If the module uses DB0..DB15 instead, shift the mapping by one.
      cfg.pin_d0  = GPIO_NUM_4;   // DB1(B)  -> IO4
      cfg.pin_d1  = GPIO_NUM_5;   // DB2(B)  -> IO5
      cfg.pin_d2  = GPIO_NUM_6;   // DB3(B)  -> IO6
      cfg.pin_d3  = GPIO_NUM_7;   // DB4(B)  -> IO7
      cfg.pin_d4  = GPIO_NUM_15;  // DB5(B)  -> IO15
      cfg.pin_d5  = GPIO_NUM_8;   // DB6(G)  -> IO8
      cfg.pin_d6  = GPIO_NUM_20;  // DB7(G)  -> IO20 (USB_D+)
      cfg.pin_d7  = GPIO_NUM_3;   // DB8(G)  -> IO3
      cfg.pin_d8  = GPIO_NUM_46;  // DB9(G)  -> IO46
      cfg.pin_d9  = GPIO_NUM_9;   // DB10(G) -> IO9
      cfg.pin_d10 = GPIO_NUM_10;  // DB11(R) -> IO10 (SPICS0)
      cfg.pin_d11 = GPIO_NUM_11;  // DB13(R) -> IO11 (SPID)  (note: table labels DB13 at IO11)
      cfg.pin_d12 = GPIO_NUM_12;  // DB14(R) -> IO12 (SPICLK)
      cfg.pin_d13 = GPIO_NUM_13;  // DB15(R) -> IO13 (SPIQ)
      cfg.pin_d14 = GPIO_NUM_14;  // DB16(R) -> IO14
      cfg.pin_d15 = GPIO_NUM_0;   // DB17(R) -> IO0 (BOOT / DB17)

      // Control / timing pins
      cfg.pin_henable = GPIO_NUM_18;  // DE    -> IO18
      cfg.pin_vsync   = GPIO_NUM_17;  // VSYNC -> IO17
      cfg.pin_hsync   = GPIO_NUM_16;  // HSYNC -> IO16
      cfg.pin_pclk    = GPIO_NUM_21;  // PCLK  -> IO21

      cfg.freq_write = 14000000; // 14MHz for RGB bus

      // Timing parameters for ST7701
      cfg.hsync_polarity    = 0;
      cfg.hsync_front_porch = 10;
      cfg.hsync_pulse_width = 8;
      cfg.hsync_back_porch  = 50;
      cfg.vsync_polarity    = 0;
      cfg.vsync_front_porch = 10;
      cfg.vsync_pulse_width = 8;
      cfg.vsync_back_porch  = 20;
      cfg.pclk_idle_high    = 0;
      cfg.de_idle_high      = 1;

      _bus_instance.config(cfg);
    }
    _panel_instance.setBus(&_bus_instance);

    // Backlight (PWM) — we also force BL on in setup() to ensure power during debug
    {
      auto cfg = _light_instance.config();
      cfg.pin_bl = TFT_BL_PIN;
      cfg.freq = TFT_BL_FREQ;
      cfg.pwm_channel = TFT_BL_PWM_CHANNEL;
      cfg.invert = false; // try false first; set true if BL is inverted
      _light_instance.config(cfg);
      _panel_instance.setLight(&_light_instance);
    }

    setPanel(&_panel_instance);
  }
};



LGFX display;
Adafruit_FT6206 touchController;
bool displayReady = false;
bool touchReady = false;
int currentServiceIndex = 0;
bool displayNeedsUpdate = true;
unsigned long lastDisplaySwitch = 0;
const unsigned long DISPLAY_ROTATION_INTERVAL = 8000;

// Service types
// Right now the behavior for each is rudimentary
// However, you can use this to expand and add services with more complex checks
enum ServiceType {
  TYPE_HOME_ASSISTANT,
  TYPE_JELLYFIN,
  TYPE_HTTP_GET,
  TYPE_PING
};

// Service structure
struct Service {
  String id;
  String name;
  ServiceType type;
  String host;
  int port;
  String path;
  String expectedResponse;
  int checkInterval;
  int passThreshold;      // Number of consecutive passes required to mark as UP
  int failThreshold;      // Number of consecutive fails required to mark as DOWN
  int consecutivePasses;  // Current count of consecutive passes
  int consecutiveFails;   // Current count of consecutive fails
  bool isUp;
  unsigned long lastCheck;
  unsigned long lastUptime;
  String lastError;
  int secondsSinceLastCheck;
};

// Store up to 20 services
const int MAX_SERVICES = 20;
Service services[MAX_SERVICES];
int serviceCount = 0;

// prototype declarations
void initWiFi();
void initWebServer();
void initFileSystem();
void initDisplay();
void loadServices();
void saveServices();
String generateServiceId();
void checkServices();
void sendOfflineNotification(const Service& service);
void sendOnlineNotification(const Service& service);
void sendSmtpNotification(const String& title, const String& message);
bool checkHomeAssistant(Service& service);
bool checkJellyfin(Service& service);
bool checkHttpGet(Service& service);
bool checkPing(Service& service);
String getWebPage();
String getServiceTypeString(ServiceType type);
String base64Encode(const String& input);
bool readSmtpResponse(WiFiClient& client, int expectedCode);
bool sendSmtpCommand(WiFiClient& client, const String& command, int expectedCode);
void renderServiceOnDisplay();
void handleDisplayLoop();

void setup() {
  Serial.begin(115200);
  delay(1000);

  Serial.println("Starting ESP32 Uptime Monitor...");

